wegam/STM32F1xWorkSpace/Driver/WOW/SCR/STM32_USART - 20180815.C
/******************************** User_library *********************************
* 文件名 	: STM32_SDCard.H
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2016/01/01
* 说明   	: 
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/


#include "STM32_USART.H"

#include "STM32_GPIO.H"
#include "STM32_SYSTICK.H"
#include 	"LinkedList.H"

#include "stm32f10x_dma.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_nvic.h"
#include "stm32f10x_rcc.h"

#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间


/*##############################################################################
################################################################################
设置波特率时的误差计算
--------------------------------------------------------------------------------
波特率				|fPCLK = 36MHz	误差%			|		fPCLK = 72MHz	误差%			|
--------------------------------------------------------------------------------
2400				|						0%						|						0%							
--------------------------------------------------------------------------------
9600				|						0%						|						0%								
--------------------------------------------------------------------------------
19200				|						0%						|						0%							
--------------------------------------------------------------------------------
57600				|						0%						|						0%							
--------------------------------------------------------------------------------
115200			|						0.15%					|						0%							
--------------------------------------------------------------------------------
230400			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
460800			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
921600			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
2250000			|						0%						|						0%							
--------------------------------------------------------------------------------

################################################################################
###############################################################################*/

//--------USART全局变量定义
#define	uRxSize		256				//默认串口DMA接收缓冲大小,如果配置时未输入缓存大小时使用的默认值
#define	uTxSize		uRxSize		//默认串口DMA发送缓冲大小
#define	uBaudRate	115200	//默认串口波特率
unsigned char uRx1Addr[uRxSize]	=	{0};					//串口1接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址
unsigned char uRx2Addr[uRxSize]	=	{0};					//串口2接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址
unsigned char uRx3Addr[uRxSize]	=	{0};					//串口3接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址
unsigned char uRx4Addr[uRxSize]	=	{0};					//串口4接收缓冲区地址::发送缓冲区地址在发送数据时设定，串口配置时借用接收缓冲区地址

unsigned char uTx1Addr[uTxSize]	=	{0};					//串口1发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送
unsigned char uTx2Addr[uTxSize]	=	{0};					//串口2发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送
unsigned char uTx3Addr[uTxSize]	=	{0};					//串口3发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送
unsigned char uTx4Addr[uTxSize]	=	{0};					//串口4发送缓冲区地址::将待发送数据拷贝到此缓冲进行发送

uLinkDef	uLink1;				//串口1链表头
uLinkDef	uLink2;				//串口2链表头
uLinkDef	uLink3;				//串口3链表头
uLinkDef	uLink4;				//串口4链表头

static struct
{
  unsigned short nUSART1;
  unsigned short nUSART2;
  unsigned short nUSART3;
  unsigned short nUART4;
//  unsigned short nUART5;	  //----无DMA
}SetDmaSize;      //配置时设置的DMA接收缓存大小
static struct
{
  unsigned short nUSART1;
  unsigned short nUSART2;
  unsigned short nUSART3;
  unsigned short nUART4;
//  unsigned short nUART5;	  //----无DMA
}RemaDmaSize;     //DMA开启后剩余DMA接收缓存大小，通过与设置的DMA缓存大小来判断数据是否在接收
static struct
{
  unsigned short nUSART1;
  unsigned short nUSART2;
  unsigned short nUSART3;
  unsigned short nUART4;
//  unsigned short nUART5;	  //----无DMA
}RetryCount;
//static unsigned short gUSART1_BufferSizebac=0;		//串口1DMA缓冲大小备份，配置时写入实际值，计算接收数据个数里需要使用
//static unsigned short gUSART2_BufferSizebac=0;		//串口2DMA缓冲大小备份，配置时写入实际值，计算接收数据个数里需要使用
//static unsigned short gUSART3_BufferSizebac=0;		//串口3DMA缓冲大小备份，配置时写入实际值，计算接收数据个数里需要使用
//static unsigned short gUART4_BufferSizebac=0;			//串口4DMA缓冲大小备份，配置时写入实际值，计算接收数据个数里需要使用
//static unsigned short gUART5_BufferSizebac=0;			//----无DMA

//static unsigned short gUSART1_BufferSizeRema=0;		//串口1DMA缓冲大小剩余
//static unsigned short gUSART2_BufferSizeRema=0;		//串口2DMA缓冲大小剩余
//static unsigned short gUSART3_BufferSizeRema=0;		//串口3DMA缓冲大小剩余
//static unsigned short gUART4_BufferSizeRema=0;		//串口4DMA缓冲大小剩余
//static unsigned short gUART5_BufferSizeRema=0;		//----无DMA

//static unsigned short gUSART1_RetryCount=0;		//串口1重试计数
//static unsigned short gUSART2_RetryCount=0;		//串口2重试计数
//static unsigned short gUSART3_RetryCount=0;		//串口3重试计数
//static unsigned short gUART4_RetryCount=0;		//串口4重试计数
//static unsigned short gUART5_RetryCount=0;		//----无DMA

//char	*DMAPrintf_Buffer=NULL;			//USART_DMAPrintf动态空间地址
char	DMAPrintf_Buffer[128]={0x00};			//4K串口printf打印存储空间(动态空间有时可能申请失败)

//--------内部使用函数定义
//*****************RS485收发控制
void RS485_TX_EN(RS485_TypeDef *RS485_Info);	//发使能
void RS485_RX_EN(RS485_TypeDef *RS485_Info);		//收使能，已经设置为接收状态返回1，否则返回0

/*******************************************************************************
*函数名			:	USART_DMA_ConfigurationNr
*功能描述		:	USART_DMA配置--查询方式，不开中断
*输入				: 
*返回值			:	无
*******************************************************************************/
void	USART_DMA_ConfigurationNR(
																USART_TypeDef* USARTx,	//串口号--USART1,USART2,USART3,UART4;//UART5不支持DMA
																u32 USART_BaudRate,			//波特率
																u16 BufferSize					//设定接收缓冲区大小
)	//USART_DMA配置--查询方式，不开中断
{
	//1)**********定义变量	
	DMA_InitTypeDef DMA_Initstructure;
	
	USART_InitTypeDef USART_InitStructure;				//USART结构体	
	GPIO_InitTypeDef GPIO_InitStructure;					//GPIO结构体
	
	DMA_Channel_TypeDef* DMAx_Channeltx=0;			//DMA发送通道请求信号---当DMA串口发送数据完成时，会发起DMA中断
	DMA_Channel_TypeDef* DMAx_Channelrx=0;			//DMA接收通道请求信号---DMA串口接收由串口发起中断，因此此处接收通道中断不使用
//	u8 DMAx_Channelx_IRQChannel=0;							//DMA中断源
	u32 DMAx_FLAG_GLtx=0;												//DMA串口发送中断全局变量			
	u32 DMAx_FLAG_GLrx=0;												//DMA串口接收中断全局变量
	
	u16 TXD_Pin=0;																//串口发送脚
	u16 RXD_Pin=0;																//串口接收脚
	u8*	RXDBuffer	=	0;
	GPIO_TypeDef* GPIO_TX=0;
	GPIO_TypeDef* GPIO_RX=0;
	switch(*(u32*)&USARTx)
	{
		case 	USART1_BASE:
					if(BufferSize	==	0)	//如果未设定缓存大小，使用默认值
						SetDmaSize.nUSART1=uRxSize;
					else
						SetDmaSize.nUSART1=BufferSize;
					RXDBuffer	=	uRx1Addr;
					GPIO_TX=GPIOA;
					GPIO_RX=GPIOA;
					TXD_Pin=GPIO_Pin_9;											//USART1-TX>PA9
					RXD_Pin=GPIO_Pin_10;										//USART1-RX>PA10
					RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA|RCC_APB2Periph_AFIO,ENABLE);
					RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);	//USART1时钟开启			
					break;
		case 	USART2_BASE:
					if(BufferSize	==	0)	//如果未设定缓存大小，使用默认值
						SetDmaSize.nUSART2=uRxSize;
					else
						SetDmaSize.nUSART2=BufferSize;
					RXDBuffer	=	uRx2Addr;
					GPIO_TX=GPIOA;
					GPIO_RX=GPIOA;
					TXD_Pin=GPIO_Pin_2;		//USART2-TX>PA2
					RXD_Pin=GPIO_Pin_3;		//USART2-RX>PA3
					RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
					RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);	//USART2时钟开启		
					break;
		case 	USART3_BASE:
					if(BufferSize	==	0)	//如果未设定缓存大小，使用默认值
						SetDmaSize.nUSART3=uRxSize;
					else
						SetDmaSize.nUSART3=BufferSize;
					RXDBuffer	=	uRx3Addr;
					GPIO_TX=GPIOB;
					GPIO_RX=GPIOB;
					TXD_Pin=GPIO_Pin_10;	//USART3-TX>PB10
					RXD_Pin=GPIO_Pin_11;	//USART3-RX>PB11
					
