wegam/STM32F1xWorkSpace/Driver/WOW/SCR/STM32_USART - 20180815.C
	//8)**********配置相关中断
	//8.1)**********串口接收中断配置
	//--将串口接收中断关闭，然后开启串口空闲中断，利用DMA自动接收串口数据
	//--若DMA接收未开启，则使用串口接收中断
	//--若DMA接收开启，串口接收中断应该关闭，在DMA配置中会将串口接收中断关闭
//	USART_ITConfig(USARTx,USART_IT_RXNE, DISABLE);				//接收中断--关：因为DMA自动接收，
	
	/* 启动DMA1通道5*/
	DMA_Cmd(DMAx_Channeltx,DISABLE);				//关闭DMA发送----需要发送时再打开
	//10.2)**********使能串口
	DMA_Cmd(DMAx_Channelrx,ENABLE);					//打开DMA接收----自动接收串口数据	
	//9.1)**********关闭DMA发送	
	
	//8.2)**********使能串口DMA方式接收
	USART_DMACmd(USARTx,USART_DMAReq_Rx,ENABLE);
	//8.3)**********使能串口DMA方式发送
	USART_DMACmd(USARTx,USART_DMAReq_Tx,ENABLE);
	//9)**********清除相关中断标志位	
	//	DMA_Cmd(DMAx_Channeltx,ENABLE);
	//9.2)**********使能相关DMA通道传输完成中断
	DMA_ITConfig(DMAx_Channeltx,DMA_IT_TC, DISABLE);
	//9.3)**********清除串口DMA方式发送中断全局标志
	DMA_ClearFlag(DMAx_FLAG_GLtx);                                 					// 清除DMA所有标志
	//9.3)**********清除串口DMA方式接收中断全局标志
	DMA_ClearFlag(DMAx_FLAG_GLrx);                                 					// 清除DMA所有标志	
	//10.1)**********启动串口DMA方式接收	
	
	USART_ITConfig(USARTx,USART_IT_IDLE, DISABLE);					//使用空闲中断，DMA自动接收，检测到总线空闲表示发送端已经发送完成，数据保存在DMA缓冲器中
	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 					//清除空闲串口标志位
	
	USART_Cmd(USARTx, ENABLE);

}
/*******************************************************************************
* 函数名			:	USART_ReadBuffer
* 功能描述		:	串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer， 
* 输入			: void
* 返回值			: void
*******************************************************************************/
u16	USART_ReadBufferIDLE(
											USART_TypeDef* USARTx,	//串口号--USART1,USART2,USART3,UART4;//UART5不支持DMA
											u8 *RevBuffer						//数据保存缓冲区地址，如果串口的接收到数据，将数据拷贝到RevBuffer
)	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
{
	u16 length=0;
	switch(*(u32*)&USARTx)
	{
		case 	USART1_BASE:
					if(USART_GetITStatus(USART1,USART_IT_IDLE)||USART_GetFlagStatus(USART1,USART_FLAG_IDLE))
					{
						USART_ClearITPendingBit(USART1,USART_IT_IDLE); 							//清除空闲串口标志位
						USART_ClearFlag(USART1,USART_FLAG_IDLE); 										//清除空闲串口标志位

						DMA1_Channel5->CCR &= (u32)0xFFFFFFFE;											//DMA_Cmd(DMA1_Channel5,DISABLE);//DMA发送关闭，只能在DMA关闭情况下才可以写入CNDTR					
						
						//------计算接收长度及读取数据
						USART1->DR; 																								//读出数据以完成清除标志			
						length = DMA1_Channel5->CNDTR;															//DMA_GetCurrDataCounter(DMA1_Channel5);	//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
						length=SetDmaSize.nUSART1-length;												    //设定缓冲区大小减剩余缓冲区大小得到实际接收到的数据个数
						memcpy(RevBuffer,uRx1Addr,length);													//复制指定大小的数据
						
						//------重新指向接收缓冲区地址并使能DMA接收			
						DMA1_Channel5->CMAR=(u32)uRx1Addr;							//重新设置DMA接收地址
						DMA1_Channel5->CNDTR=SetDmaSize.nUSART1;			  //重新设置接收数据个数			
						DMA_Cmd(DMA1_Channel5,ENABLE);  								//开启接收DMA
						
						return length;			//返回接收到的数据个数
					}			
					break;
			case 	USART2_BASE:
					if(USART_GetITStatus(USART2,USART_IT_IDLE)||USART_GetFlagStatus(USART2,USART_FLAG_IDLE))
					{
						USART_ClearITPendingBit(USART2,USART_IT_IDLE); 							//清除空闲串口标志位
						USART_ClearFlag(USART2,USART_FLAG_IDLE); 										//清除空闲串口标志位

						DMA1_Channel6->CCR &= (u32)0xFFFFFFFE;											//DMA_Cmd(DMA1_Channel6,DISABLE);//DMA发送关闭，只能在DMA关闭情况下才可以写入CNDTR					
						
						//------计算接收长度及读取数据
						USART2->DR; 																								//读出数据以完成清除标志			
						length = DMA1_Channel6->CNDTR;															//DMA_GetCurrDataCounter(DMA1_Channel6);	//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
						length=SetDmaSize.nUSART2-length;												    //设定缓冲区大小减剩余缓冲区大小得到实际接收到的数据个数
						memcpy(RevBuffer,uRx2Addr,length);													//复制指定大小的数据
						
						//------重新指向接收缓冲区地址并使能DMA接收			
						DMA1_Channel6->CMAR=(u32)uRx2Addr;							//重新设置DMA接收地址
						DMA1_Channel6->CNDTR=SetDmaSize.nUSART2;			  //重新设置接收数据个数
						DMA1_Channel6->CCR |=(u32)0x00000001;						//DMA_Cmd(DMA1_Channel6,ENABLE);//DMA接收开启3						
						return length;			//返回接收到的数据个数
					}			
					break;
			case 	USART3_BASE:
					if(USART_GetITStatus(USART3,USART_IT_IDLE)||USART_GetFlagStatus(USART3,USART_FLAG_IDLE))
					{
						USART_ClearITPendingBit(USART3,USART_IT_IDLE); 							//清除空闲串口标志位
						USART_ClearFlag(USART3,USART_FLAG_IDLE); 										//清除空闲串口标志位

						DMA1_Channel3->CCR &= (u32)0xFFFFFFFE;											//DMA_Cmd(DMA1_Channel3,DISABLE);//DMA发送关闭，只能在DMA关闭情况下才可以写入CNDTR					
						
						//------计算接收长度及读取数据
						USART2->DR; 																								//读出数据以完成清除标志			
						length = DMA1_Channel3->CNDTR;															//DMA_GetCurrDataCounter(DMA1_Channel3);	//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
						length=SetDmaSize.nUSART3-length;   												//设定缓冲区大小减剩余缓冲区大小得到实际接收到的数据个数
						memcpy(RevBuffer,uRx3Addr,length);													//复制指定大小的数据
						
						//------重新指向接收缓冲区地址并使能DMA接收			
						DMA1_Channel3->CMAR=(u32)uRx3Addr;							//重新设置DMA接收地址
						DMA1_Channel3->CNDTR=SetDmaSize.nUSART3;			  //重新设置接收数据个数
						DMA1_Channel3->CCR |=(u32)0x00000001;						//DMA_Cmd(DMA1_Channel3,ENABLE);//DMA接收开启3						
						return length;			//返回接收到的数据个数
					}			
					break;
			case 	UART4_BASE:
					if(USART_GetITStatus(UART4,USART_IT_IDLE)||USART_GetFlagStatus(UART4,USART_FLAG_IDLE))
					{
						USART_ClearITPendingBit(UART4,USART_IT_IDLE); 							//清除空闲串口标志位
						USART_ClearFlag(UART4,USART_FLAG_IDLE); 										//清除空闲串口标志位

						DMA2_Channel3->CCR &= (u32)0xFFFFFFFE;											//DMA_Cmd(DMA2_Channel3,DISABLE);//DMA发送关闭，只能在DMA关闭情况下才可以写入CNDTR					
						
						//------计算接收长度及读取数据
						USART2->DR; 																								//读出数据以完成清除标志			
						length = DMA2_Channel3->CNDTR;															//DMA_GetCurrDataCounter(DMA2_Channel3);	//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
						length=SetDmaSize.nUART4-length;				    								//设定缓冲区大小减剩余缓冲区大小得到实际接收到的数据个数
						memcpy(RevBuffer,uRx4Addr,length);													//复制指定大小的数据
						
						//------重新指向接收缓冲区地址并使能DMA接收			
						DMA2_Channel3->CMAR=(u32)uRx4Addr;							//重新设置DMA接收地址
						DMA2_Channel3->CNDTR=SetDmaSize.nUART4;		    	//重新设置接收数据个数
						DMA2_Channel3->CCR |=(u32)0x00000001;						//DMA_Cmd(DMA2_Channel3,ENABLE);//DMA接收开启3						
						return length;			//返回接收到的数据个数
					}			
					break;
			case UART5_BASE:
					//UART5不支持DMA
					return 0;
		default:break;
	}
	return 0;
}

