wegam/STM32F1xWorkSpace/Driver/WOW/SCR/STM32_USART - 20180815.C
/*******************************************************************************
*函数名		: function
*功能描述	:	串口接收服务函数
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:	USART_DMASend(USART2,"中文ENG=%d\n",num);
*特别说明	:	在DMA发送完成后需要释放动态空间，free(USART_BUFFER);
					:	USART_BUFFER定义在STM32_USART.H
*******************************************************************************/
u16 USART_DMAPrintf(USART_TypeDef* USARTx,const char *format,...)		//后边的省略号就是可变参数
{
	
//		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
//    static char string[ 256 ];			//定义数组，
//    va_start( ap, format );
//    vsprintf( string , format, ap );    
//    va_end( ap );
	
	
//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送
//8)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
//	if(DMAPrintf_Buffer!=NULL)
//	{
//		free(DMAPrintf_Buffer);						//释放动态空间
//	}
//	u8	*USART_BUFFER;
	//1)**********获取数据宽度
//	u32 num=strlen((const char*)format);		//获取数据宽度
	//2)**********定义缓冲区大小变量
	unsigned int BufferSize=0;
	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list args;  
//	free(DMAPrintf_Buffer);						//释放动态空间
//	DMAPrintf_Buffer=NULL;
	//4)**********申请动态空间
//	DMAPrintf_Buffer = (char*)malloc(sizeof(char) * num);	
	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(args, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	BufferSize = vsprintf((char*)DMAPrintf_Buffer, format, args);
	//7)**********结束可变参数的获取
	va_end(args); 
	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送
	//8)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
	if(USARTx==USART1)
	{
		BufferSize=USART_DMASend(USART1,(u8*)DMAPrintf_Buffer,BufferSize);	//串口DMA发送程序
	}
	else if(USARTx==USART2)
	{
		BufferSize=USART_DMASend(USART2,(u8*)DMAPrintf_Buffer,BufferSize);	//串口DMA发送程序
	}
	else if(USARTx==USART3)
	{
		BufferSize=USART_DMASend(USART3,(u8*)DMAPrintf_Buffer,BufferSize);	//串口DMA发送程序
	}
	else if(USARTx==UART4)
	{
		BufferSize=USART_DMASend(UART4,(u8*)DMAPrintf_Buffer,BufferSize);	//串口DMA发送程序
	}
	else if(USARTx==UART5)
	{
		//UART5不支持DMA
		BufferSize=0;
	}
//	free(DMAPrintf_Buffer);						//释放动态空间
	return BufferSize;			//返回发送数据大小

}
/*******************************************************************************
*函数名			:	USART_DMASend
*功能描述		:	串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
*输入				: 
*返回值			:	如果数据已经传入到DMA，返回Buffer大小，否则返回0（发送器忙）
*******************************************************************************/
u16 USART_DMASend(
									USART_TypeDef* USARTx,									//串口号--USART1,USART2,USART3,UART4;//UART5不支持DMA
									u8 *tx_buffer,													//待发送数据缓冲区地址
									u16 BufferSize													//设定发送数据大小
)		//串口DMA发送程序
{
	if(BufferSize>uTxSize)	//防止内存溢出
		BufferSize	=	uTxSize;
	switch(*(u32*)&USARTx)
	{
		case USART1_BASE:
					//检查USART有无配置
					if((u16)(USARTx->CR1 &0x2000)!= 0x2000)					//串口未配置
					{
						USART_DMA_ConfigurationNR	(USART1,uBaudRate,uRxSize);	//USART_DMA配置--查询方式，不开中断
					}
					if(
							(DMA1_Channel4->CNDTR==0)										//通道空闲--已发完数据
						||((DMA1_Channel4->CCR&0x00000001)==0)				//通道未开启
						)
					{
						memcpy(uTx1Addr,tx_buffer,BufferSize);
						DMA1_Channel4->CCR &= (u32)0xFFFFFFFE;				//DMA_Cmd(DMA1_Channel4,DISABLE);//DMA发送关闭，只能在DMA关闭情况下才可以写入CNDTR					
						DMA1->IFCR = DMA1_FLAG_GL4;										//DMA_ClearFlag(DMA1_FLAG_TC4);	//清除标志						
						DMA1_Channel4->CNDTR 	=BufferSize;						//设定待发送缓冲区大小
						DMA1_Channel4->CMAR 	=(u32)uTx1Addr;				//发送缓冲区
						DMA1_Channel4->CCR |=(u32)0x00000001;					//DMA_Cmd(DMA1_Channel4,ENABLE);//DMA发送开启3
						return BufferSize;
					}
					else
					{
						//链表缓存
					}
			break;
			case USART2_BASE:
					//检查USART有无配置
					if((u16)(USARTx->CR1 &0x2000)!= 0x2000)					//串口未打开
					{
						USART_DMA_ConfigurationNR	(USART2,uBaudRate,uRxSize);	//USART_DMA配置--查询方式，不开中断
					}
					if(
							(DMA1_Channel7->CNDTR==0)										//通道空闲--已发完数据
						||((DMA1_Channel7->CCR&0x00000001)==0)				//通道未开启
						)
					{
						memcpy(uTx2Addr,tx_buffer,BufferSize);
						DMA1_Channel7->CCR &= (u32)0xFFFFFFFE;				//DMA_Cmd(DMA1_Channel7,DISABLE);//DMA发送关闭，只能在DMA关闭情况下才可以写入CNDTR					
						DMA1->IFCR = DMA1_FLAG_GL7;										//DMA_ClearFlag(DMA1_FLAG_TC7);	//清除标志						
						DMA1_Channel7->CNDTR 	=BufferSize;						//设定待发送缓冲区大小
						DMA1_Channel7->CMAR 	=(u32)uTx2Addr;				  //发送缓冲区
						DMA1_Channel7->CCR |=(u32)0x00000001;					//DMA_Cmd(DMA1_Channel7,ENABLE);//DMA发送开启3
						return BufferSize;
					}
			break;
			case USART3_BASE:
					//检查USART有无配置
					if((u16)(USARTx->CR1 &0x2000)!= 0x2000)					//串口未打开
					{
						USART_DMA_ConfigurationNR	(USART3,uBaudRate,uRxSize);	//USART_DMA配置--查询方式，不开中断
					}
					if(
							(DMA1_Channel2->CNDTR==0)										//通道空闲--已发完数据
						||((DMA1_Channel2->CCR&0x00000001)==0)				//通道未开启
						)
					{
						memcpy(uTx3Addr,tx_buffer,BufferSize);
						DMA1_Channel2->CCR &= (u32)0xFFFFFFFE;				//DMA_Cmd(DMA1_Channel2,DISABLE);//DMA发送关闭，只能在DMA关闭情况下才可以写入CNDTR					
						DMA1->IFCR = DMA1_FLAG_GL2;										//DMA_ClearFlag(DMA1_FLAG_TC2);	//清除标志						
						DMA1_Channel2->CNDTR 	=BufferSize;						//设定待发送缓冲区大小
						DMA1_Channel2->CMAR 	=(u32)uTx3Addr;				//发送缓冲区
						DMA1_Channel2->CCR |=(u32)0x00000001;					//DMA_Cmd(DMA1_Channel2,ENABLE);//DMA发送开启3
						return BufferSize;
					}
			break;
			case UART4_BASE:
					//检查USART有无配置
					if((u16)(USARTx->CR1 &0x2000)!= 0x2000)					//串口未打开
					{
						USART_DMA_ConfigurationNR	(UART4,uBaudRate,uRxSize);	//USART_DMA配置--查询方式，不开中断
					}
					if(
							(DMA2_Channel5->CNDTR==0)										//通道空闲--已发完数据
						||((DMA2_Channel5->CCR&0x00000001)==0)				//通道未开启
						)
					{
						memcpy(uTx4Addr,tx_buffer,BufferSize);
						DMA2_Channel5->CCR &= (u32)0xFFFFFFFE;				//DMA_Cmd(DMA1_Channel2,DISABLE);//DMA发送关闭，只能在DMA关闭情况下才可以写入CNDTR					
						DMA2->IFCR = DMA2_FLAG_GL5;										//DMA_ClearFlag(DMA2_FLAG_TC5);	//清除标志						
						DMA2_Channel5->CNDTR 	=BufferSize;						//设定待发送缓冲区大小
						DMA2_Channel5->CMAR 	=(u32)uTx4Addr;				//发送缓冲区
						DMA2_Channel5->CCR |=(u32)0x00000001;					//DMA_Cmd(DMA2_Channel5,ENABLE);//DMA发送开启3
						return BufferSize;
					}
			break;
			case UART5_BASE:
					//UART5不支持DMA
					return 0;
		default:break;
	}	
	return 0;
}
/*******************************************************************************
*函数名			:	USART_DMASend
*功能描述		:	串口状态检查--检查DMA缓存大小判断使用状态
*输入				: 
*返回值			:	
*******************************************************************************/
USARTStatusDef	USART_Status(USART_TypeDef* USARTx)		//串口状态检查
{
  unsigned short	BufferSize	=	0;			//剩余缓存大小
  
	USARTStatusDef	Status;
	FlagStatus bitstatus = RESET;
  
  Status.USART_IDLESTD  = 0;
	
	switch(*(u32*)&USARTx)
	{
		case USART1_BASE:
				//接收状态检查
				BufferSize	=	DMA1_Channel5->CNDTR;		      //获取DMA接收缓存剩余空间
				if(BufferSize<SetDmaSize.nUSART1)	          //可用缓存小于预设大小，表示已使用
				{
					if(RemaDmaSize.nUSART1	== BufferSize)    //查询可用缓存大小是否继续在变化从而判断是否还在接收中
					{
						RetryCount.nUSART1++;
						if(RetryCount.nUSART1>=5)               //连续5次查询未变化表示接收完成
						{
							RetryCount.nUSART1	  =	0;
              Status.USART_IDLESTD  = 0;            //空闲
						}
					}
          //还在接收中
					else
					{
						RemaDmaSize.nUSART1	=	BufferSize;       //更新
            Status.USART_IDLESTD  = 1;             //非空闲
            Status.USART_ReceSTD  = 1;              //正在接收中
					}					
				}
				//发送状态检查
				if((DMA1_Channel4->CNDTR!=0)&&((DMA1_Channel4->CCR&0x00000001)!=0))   //还在发送中
				{
          Status.USART_IDLESTD  = 1;        //非空闲
          Status.USART_SendSTD  = 1;        //正在发送中
				}
				else
				{
					bitstatus	=	USART_GetFlagStatus(USART1,USART_FLAG_TC);		//检测发送数据寄存器是否为空	RESET-非空，SET-空，
					if(bitstatus	!=	SET)
          {
						Status.USART_IDLESTD  = 1;        //非空闲
            Status.USART_SendSTD  = 1;        //正在发送中            
          }
          else
          {
            Status.USART_IDLESTD  = 0;        //空闲
          }
				}
				break;
		case USART2_BASE:
				//接收状态检查
				BufferSize	=	DMA1_Channel6->CNDTR;		//获取DMA接收缓存剩余空间
				if(BufferSize<SetDmaSize.nUSART2)	    //缓存在减小，表示在使用
				{
					if(RemaDmaSize.nUSART2	== BufferSize)
					{
						RetryCount.nUSART2++;
						if(RetryCount.nUSART2>=5)
						{
							RetryCount.nUSART2	=	0;
							Status.USART_IDLESTD  = 0;        //空闲
						}
					}
					else
					{
						RemaDmaSize.nUSART2	=	BufferSize;
						Status.USART_IDLESTD  = 1;        //非空闲
            Status.USART_ReceSTD  = 1;        //正在接收中
					}
				}
				//发送状态检查
				if((DMA1_Channel7->CNDTR!=0)&&((DMA1_Channel7->CCR&0x00000001)!=0))
				{
					Status.USART_IDLESTD  = 1;        //非空闲
          Status.USART_SendSTD  = 1;        //正在发送中
				}
				else
				{
					bitstatus	=	USART_GetFlagStatus(USART2,USART_FLAG_TC);		//检测发送数据寄存器是否为空	RESET-非空，SET-空，
					if(bitstatus	!=	SET)
					{
						Status.USART_IDLESTD  = 1;        //非空闲
            Status.USART_SendSTD  = 1;        //正在发送中            
          }
          else
          {
            Status.USART_IDLESTD  = 0;        //空闲
          }
				}
				break;
		case USART3_BASE:
				//接收状态检查
				BufferSize	=	DMA1_Channel3->CNDTR;		//获取DMA接收缓存剩余空间
				if(BufferSize<SetDmaSize.nUSART3)	    //缓存在减小，表示在使用
				{
					if(RemaDmaSize.nUSART3	== BufferSize)
					{
						RetryCount.nUSART3++;
						if(RetryCount.nUSART3>=5)
						{
							RetryCount.nUSART3	=	0;
							Status.USART_IDLESTD  = 0;        //空闲
						}
					}
					else
					{
						RemaDmaSize.nUSART3	=	BufferSize;
						Status.USART_IDLESTD  = 1;        //非空闲
            Status.USART_ReceSTD  = 1;        //正在接收中
					}
				}
				//发送状态检查
				if((DMA1_Channel2->CNDTR!=0)&&((DMA1_Channel2->CCR&0x00000001)!=0))
				{
					Status.USART_IDLESTD  = 1;        //非空闲
          Status.USART_SendSTD  = 1;        //正在发送中
				}
				else
				{
					bitstatus	=	USART_GetFlagStatus(USART3,USART_FLAG_TC);		//检测发送数据寄存器是否为空	RESET-非空，SET-空，
					if(bitstatus	!=	SET)
					{
						Status.USART_IDLESTD  = 1;        //非空闲
            Status.USART_SendSTD  = 1;        //正在发送中            
          }
          else
          {
            Status.USART_IDLESTD  = 0;        //空闲
          }
				}
				break;
		case UART4_BASE:
				//接收状态检查
				BufferSize	=	DMA2_Channel3->CNDTR;		//获取DMA接收缓存剩余空间
				if(BufferSize<SetDmaSize.nUART4)	    //缓存在减小，表示在使用
				{
					if(RemaDmaSize.nUART4	== BufferSize)
					{
						RetryCount.nUART4++;
						if(RetryCount.nUART4>=5)
						{
							RetryCount.nUART4	=	0;
							Status.USART_IDLESTD  = 0;        //空闲
						}
					}
					else
					{
						RemaDmaSize.nUART4	=	BufferSize;
						Status.USART_IDLESTD  = 1;        //非空闲
            Status.USART_ReceSTD  = 1;        //正在接收中
					}
				}
				//发送状态检查
				if((DMA2_Channel5->CNDTR!=0)&&((DMA2_Channel5->CCR&0x00000001)!=0))
				{
					Status.USART_IDLESTD  = 1;        //非空闲
          Status.USART_SendSTD  = 1;        //正在发送中
				}
				else
				{
					bitstatus	=	USART_GetFlagStatus(UART4,USART_FLAG_TC);		//检测发送数据寄存器是否为空	RESET-非空，SET-空，
					if(bitstatus	!=	SET)
					{
						Status.USART_IDLESTD  = 1;        //非空闲
            Status.USART_SendSTD  = 1;        //正在发送中            
          }
          else
          {
            Status.USART_IDLESTD  = 0;        //空闲
          }
				}
				break;
		default:break;
	}
	return Status;
}




//----------------------RS485---------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	RS485_TX_EN
*功能描述		:	使能RS485发送---拉高控制脚
*输入				: 
*返回值			:	无
*******************************************************************************/
void RS485_TX_EN(RS485_TypeDef *RS485_Info)
{
	RS485_Info->RS485_CTL_PORT->BSRR		= RS485_Info->RS485_CTL_Pin;
//	GPIO_SetBits(RS485_Info->RS485_CTL_PORT,RS485_Info->RS485_CTL_Pin);
}
/*******************************************************************************
*函数名			:	RS485_RX_EN
*功能描述		:	使能RS485接收---拉低控制脚,使能前需要检测发送状态，如果在发送中，则不使能，
*输入				: 
*返回值			:	已经设置为接收状态返回1，否则返回0
*******************************************************************************/
void RS485_RX_EN(RS485_TypeDef *RS485_Info)
{
	RS485_Info->RS485_CTL_PORT->BRR 		= RS485_Info->RS485_CTL_Pin;	
}

