wegam/STM32F1xWorkSpace/Driver/WOW/SCR/STM32_USART - 20180815.C
	//8)**********配置相关中断
	//8.1)**********串口接收中断配置
	//--将串口接收中断关闭，然后开启串口空闲中断，利用DMA自动接收串口数据
	//--若DMA接收未开启，则使用串口接收中断
	//--若DMA接收开启，串口接收中断应该关闭，在DMA配置中会将串口接收中断关闭
//	USART_ITConfig(USARTx,USART_IT_RXNE, DISABLE);				//接收中断--关：因为DMA自动接收，
	
	/* 启动DMA1通道5*/
	DMA_Cmd(DMAx_Channeltx,DISABLE);				//关闭DMA发送----需要发送时再打开
	//10.2)**********使能串口
	DMA_Cmd(DMAx_Channelrx,ENABLE);					//打开DMA接收----自动接收串口数据	
	//9.1)**********关闭DMA发送	
	
	//8.2)**********使能串口DMA方式接收
	USART_DMACmd(USARTx,USART_DMAReq_Rx,ENABLE);
	//8.3)**********使能串口DMA方式发送
	USART_DMACmd(USARTx,USART_DMAReq_Tx,ENABLE);
	//9)**********清除相关中断标志位	
	//	DMA_Cmd(DMAx_Channeltx,ENABLE);
	//9.2)**********使能相关DMA通道传输完成中断
	DMA_ITConfig(DMAx_Channeltx,DMA_IT_TC, DISABLE);
	//9.3)**********清除串口DMA方式发送中断全局标志
	DMA_ClearFlag(DMAx_FLAG_GLtx);                                 					// 清除DMA所有标志
	//9.3)**********清除串口DMA方式接收中断全局标志
	DMA_ClearFlag(DMAx_FLAG_GLrx);                                 					// 清除DMA所有标志	
	//10.1)**********启动串口DMA方式接收	
	
	USART_ITConfig(USARTx,USART_IT_IDLE, DISABLE);					//使用空闲中断，DMA自动接收，检测到总线空闲表示发送端已经发送完成，数据保存在DMA缓冲器中
	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 					//清除空闲串口标志位
	
	USART_Cmd(USARTx, ENABLE);

}
/*******************************************************************************
*函数名			:	USART_DMASend
*功能描述		:	串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
*输入				: 
*返回值			:	如果数据已经传入到DMA，返回Buffer大小，否则返回0（发送器忙）
*******************************************************************************/
u16 USART_DMASendbac(
									USART_TypeDef* USARTx,		//串口号--USART1,USART2,USART3,UART4;//UART5不支持DMA
									u32 *tx_buffer,						//待发送数据缓冲区地址
									u16 BufferSize						//设定发送数据大小
)		//串口DMA发送程序
{
	//----发送前检查相关串口发送状态，如果下在发送其它数据，则等待（返回0），否则清除相关标志位后开启发送
	
	u32	DMA_status=0;			//DMA状态	
	
	if(USARTx==USART1)
	{
		//1----先获取DMA状态，如果已经开启，则检测DMA和USART是否完成，如果未开启，直接发送数据
		DMA_status=*(vu32*)DMA1_Channel4_BASE;
		if((DMA_status&0x00000001)==0x00000001)						//DMA通道已经使能
		{
			u16 CurrDataCounter=0;																	//相关DMA通道剩余空间大小，如果是0，则表示DMA数据已经传送
			CurrDataCounter=DMA_GetCurrDataCounter(DMA1_Channel4);	//获取DMA发送缓冲区剩余数据个数，如果是0，则表示DMA数据已经传送
			if(CurrDataCounter==0)						//DMA数据已传送
			{
				FlagStatus bitstatus = RESET;
				bitstatus=USART_GetFlagStatus(USART1,USART_FLAG_TXE);		//检测发送数据寄存器是否为空	RESET-非空，SET-空，
				if(bitstatus==SET)
				{					
					DMA_ClearFlag(DMA1_FLAG_TC4);									//清除标志
					DMA_Cmd(DMA1_Channel4,DISABLE);								//DMA发送关闭
					
					//----可以继续发送新数据
					DMA1_Channel4->CNDTR =BufferSize;								//设定待发送缓冲区大小
					DMA1_Channel4->CMAR =(u32)tx_buffer;						//发送缓冲区	
					DMA_Cmd(DMA1_Channel4,ENABLE);									//DMA发送开启3
					return BufferSize;			//如果数据已经传入到DMA，返回Buffer大小
				}
				else
					return 0;
			}
		}
		else
		{
			DMA1_Channel4->CNDTR =BufferSize;										//设定待发送缓冲区大小
			DMA1_Channel4->CMAR =(u32)tx_buffer;								//发送缓冲区	
			DMA_Cmd(DMA1_Channel4,ENABLE);											//DMA发送开启3
			return BufferSize;			//如果数据已经传入到DMA，返回Buffer大小
		}
	}
	else if(USARTx==USART2)
	{
		//1----先获取DMA状态，如果已经开启，则检测DMA和USART是否完成，如果未开启，直接发送数据
		DMA_status=*(vu32*)DMA1_Channel7_BASE;
		if((DMA_status&0x00000001)==0x00000001)						//DMA通道已经使能
		{
			u16 CurrDataCounter=0;																	//相关DMA通道剩余空间大小，如果是0，则表示DMA数据已经传送
			CurrDataCounter=DMA_GetCurrDataCounter(DMA1_Channel7);	//获取DMA发送缓冲区剩余数据个数，如果是0，则表示DMA数据已经传送
			if(CurrDataCounter==0)						//DMA数据已传送
			{
				FlagStatus bitstatus = RESET;
				bitstatus=USART_GetFlagStatus(USART2,USART_FLAG_TXE);		//检测发送数据寄存器是否为空	RESET-非空，SET-空，
				if(bitstatus==SET)
				{					
					DMA_ClearFlag(DMA1_FLAG_TC7);									//清除标志
					DMA_Cmd(DMA1_Channel7,DISABLE);								//DMA发送关闭
					
					//----可以继续发送新数据
					DMA1_Channel7->CNDTR =BufferSize;								//设定待发送缓冲区大小
					DMA1_Channel7->CMAR =(u32)tx_buffer;						//发送缓冲区	
					DMA_Cmd(DMA1_Channel7,ENABLE);									//DMA发送开启3
					return BufferSize;			//如果数据已经传入到DMA，返回Buffer大小
				}
				else
					return 0;
			}
			else
					return 0;
		}
		else
		{		
			DMA1_Channel7->CNDTR =BufferSize;								//设定待发送缓冲区大小
			DMA1_Channel7->CMAR =(u32)tx_buffer;						//发送缓冲区	
			DMA_Cmd(DMA1_Channel7,ENABLE);									//DMA发送开启3
			return BufferSize;			//如果数据已经传入到DMA，返回Buffer大小
		}
	}
	else if(USARTx==USART3)
	{
		//1----先获取DMA状态，如果已经开启，则检测DMA和USART是否完成，如果未开启，直接发送数据
		DMA_status=*(vu32*)DMA1_Channel2_BASE;
		if((DMA_status&0x00000001)==0x00000001)						//DMA通道已经使能
		{
			u16 CurrDataCounter=0;																	//相关DMA通道剩余空间大小，如果是0，则表示DMA数据已经传送
			CurrDataCounter=DMA_GetCurrDataCounter(DMA1_Channel2);	//获取DMA发送缓冲区剩余数据个数，如果是0，则表示DMA数据已经传送
			if(CurrDataCounter==0)						//DMA数据已传送
			{
				FlagStatus bitstatus = RESET;
				bitstatus=USART_GetFlagStatus(USART3,USART_FLAG_TXE);		//检测发送数据寄存器是否为空	RESET-非空，SET-空，
				if(bitstatus==SET)
				{					
					DMA_ClearFlag(DMA1_FLAG_TC2);									//清除标志
					DMA_Cmd(DMA1_Channel2,DISABLE);								//DMA发送关闭
					
					//----可以继续发送新数据
					DMA1_Channel2->CNDTR =BufferSize;								//设定待发送缓冲区大小
					DMA1_Channel2->CMAR =(u32)tx_buffer;						//发送缓冲区	
					DMA_Cmd(DMA1_Channel2,ENABLE);									//DMA发送开启3
					return BufferSize;			//如果数据已经传入到DMA，返回Buffer大小
				}
				else
					return 0;
			}
			else
					return 0;
		}
		else
		{		
			DMA1_Channel2->CNDTR =BufferSize;										//设定待发送缓冲区大小
			DMA1_Channel2->CMAR =(u32)tx_buffer;							//发送缓冲区	
			DMA_Cmd(DMA1_Channel2,ENABLE);											//DMA发送开启3
			return BufferSize;			//如果数据已经传入到DMA，返回Buffer大小
		}
	}
	else if(USARTx==UART4)
	{
		//1----先获取DMA状态，如果已经开启，则检测DMA和USART是否完成，如果未开启，直接发送数据
		DMA_status=*(vu32*)DMA2_Channel5_BASE;
		if((DMA_status&0x00000001)==0x00000001)						//DMA通道已经使能
		{
			u16 CurrDataCounter=0;																	//相关DMA通道剩余空间大小，如果是0，则表示DMA数据已经传送
			CurrDataCounter=DMA_GetCurrDataCounter(DMA2_Channel5);	//获取DMA发送缓冲区剩余数据个数，如果是0，则表示DMA数据已经传送
			if(CurrDataCounter==0)						//DMA数据已传送
			{
				FlagStatus bitstatus = RESET;
				bitstatus=USART_GetFlagStatus(UART4,USART_FLAG_TXE);		//检测发送数据寄存器是否为空	RESET-非空，SET-空，
				if(bitstatus==SET)
				{					
					DMA_ClearFlag(DMA2_FLAG_TC5);									//清除标志
					DMA_Cmd(DMA2_Channel5,DISABLE);								//DMA发送关闭
					
					//----可以继续发送新数据
					DMA2_Channel5->CNDTR =BufferSize;								//设定待发送缓冲区大小
					DMA2_Channel5->CMAR =(u32)tx_buffer;						//发送缓冲区	
					DMA_Cmd(DMA2_Channel5,ENABLE);									//DMA发送开启3
					return BufferSize;			//如果数据已经传入到DMA，返回Buffer大小
				}
				else
					return 0;
			}
			else
					return 0;
		}
		else
		{
			DMA2_Channel5->CNDTR =BufferSize;										//设定待发送缓冲区大小
			DMA2_Channel5->CMAR =(u32)tx_buffer;							//发送缓冲区	
			DMA_Cmd(DMA2_Channel5,ENABLE);											//DMA发送开启3
			return BufferSize;			//如果数据已经传入到DMA，返回Buffer大小
		}
	}
	else if(USARTx==UART5)
	{
		//UART5不支持DMA
		BufferSize=0;
	}	
	return 0;
}



